Revit 2027 API
CurtainGridLine.AddSegment Method
Add a segment based on the specified segment curve of the gridline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddSegment(
	Curve curve
)
Public Sub AddSegment (
	curve As Curve
)
public:
void AddSegment(
	Curve^ curve
)
member AddSegment :
        curve : Curve -> unit
Parameters
curve Curve
 The curve used to locate the segment to be removed. This function will invoke regeneration.
Exceptions
Exception | Condition
InvalidOperationException | Segment may not have been found in location indicated by curve.
See Also
Reference
CurtainGridLine Class
Autodesk.Revit.DB Namespace